# parameters
nc: 80  # number of classes
depth_multiple: 0.5 #0.33  0.67# model depth multiple
width_multiple: 0.75 #0.50  0.75# layer channel multiple
# anchors
anchors:
### Ori value.
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326] #P5/32
# YOLOv5 backbone
backbone:
  # [from, number, module, args]  640
  #[-1, 1, Focus, [64, 3]],  # 0-P1/2   k=3,s=1,p=1;[32,320,320]
   [[-1, 1, Conv, [64, 6, 2, 2]],  ###0 320,320,32
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4   # [..., [Output channel, kernel, strides]]   k=3,s=2,p=1;[64,160,160]
   [-1, 3, C3, [128]],          # 2   [64,160,160]
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8    [128,80,80]
   [-1, 9, C3, [256]],          # 4         [128,80,80]
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16    [256,40,40]
   [-1, 9, C3, [512]],          # 6        [256,40,40]
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32     [512,20,20]
   [-1, 3, C3, [1024, False]], #8
   [-1, 1, SPP, [1024, [5, 7,13]]], #9  [512,20,20]
   [-1, 1, NonLocal, [1024]],  #10
   [-1, 1, SpatialTransformer, [1024]],  #11  F_5^st
  ]
head:
  [[-1, 1, Conv, [512, 1, 1]], #12 #[256,20,20]
   [-1,1,PSAModule,[512]], # 13     [256,20,20]
   [-1, 3, C3, [1024, False]],  #   14  [512,20,20]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #15
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4 16
   [-1,1,PSAModule,[512]], # 17
   [-1, 3, C3, [512, False]],  #   18 [512,20,20]

   [-1, 1, Conv, [256, 1, 1]],   #19
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #20
   [-1,1,PSAModule,[256]], # 21
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3  #22
   [-1, 3, C3, [256, False]],  #  (P3/8-small)  #23
#
#   [-1, 1, Conv, [256, 3, 2]], #21
#   [[-1, 16], 1, Concat, [1]],  # cat head P4  #22
#   [-1,1,PSAModule,[256]], # #23
#   [-1, 3, C3, [512, False]],  # 24 (P4/16-medium)
#
#   [-1, 1, Conv, [512, 3, 2]],  #25
#   [[-1, 12], 1, Concat, [1]],  # cat head P5 #26
#   [-1,1,PSAModule,[512]], # 27
#   [-1, 3, C3, [1024, False]],  # 28 (P5/32-large)
   [[23, 18, 14], 1, IV6Detect, [nc]],  # Detect(P3, P4, P5)
   #[[23, 18, 14], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]




# YOLOv5 head
#head:
#   [[-1, 1, Conv, [512, 1, 1]], #12
#    [-1, 1, C3_psa, [512]],  # 13 [256,20,20] Z5
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 14  [256,40,40]
#   [[-1, 6], 1, Concat, [1]],  # 15 cat backbone Z4    [512,40,40]
#   [-1, 3, C3_psa, [512, False]],  # 16       [256,40,40]
#
#   [-1, 1, Conv, [256, 1, 1]],      #17        #[128,40,40]
#   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #18   #[128,80,80]
#   [[-1, 4], 1, Concat, [1]],  # 19 cat backbone P3  #[128,80,80]
#   [-1,1,C3_psa,[256,False]], # 20
#   #[-1, 3, C3, [256, False]],  # 21 (P3/8-small)  #[128,80,80]
#
#   #[-1, 1, Conv, [256, 3, 2]],  #22 ###[128,40,40]
#   #[[-1, 17], 1, Concat, [1]],  #23 cat head P4  [128,40,40]
#   #[-1,1,PSAModule,[256,3,1]], # 24
##   [-1, 3, C3, [512, False]],  # 25 (P4/16-medium) [128,40,40]
##
##   [-1, 1, Conv, [512, 3, 2]],  ##26  [256,20,20]
##   [[-1, 13], 1, Concat, [1]],  #27  cat head P5 [256,20,20]
##   [-1,1,PSAModule,[512,3,1]], # 28
##   [-1, 3, C3, [1024, False]],  # 29 (P5/32-large) [512,20,20]
#   [[20, 16, 13], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
#  ]